SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_tim.h
/***********************************************************************************************************************
    @file     reg_tim.h
    @author   VV TEAM
    @brief    This flie contains all the TIM's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_TIM_H
#define __REG_TIM_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief TIM Base Address Definition
  */
#define  TIM2_BASE                                 0x40000000                                       /*!<Base Address: 0x40000000*/
#define  TIM3_BASE                                 0x40000400                                       /*!<Base Address: 0x40000400*/
#define  TIM4_BASE                                 0x40000800                                       /*!<Base Address: 0x40000800*/
#define  TIM5_BASE                                 0x40000C00                                       /*!<Base Address: 0x40000C00*/
#define  TIM6_BASE                                 0x40001000                                       /*!<Base Address: 0x40001000*/
#define  TIM7_BASE                                 0x40001400                                       /*!<Base Address: 0x40001400*/
#define  TIM1_BASE                                 0x40012C00                                       /*!<Base Address: 0x40012C00*/
#define  TIM8_BASE                                 0x40013400                                       /*!<Base Address: 0x40013400*/

/**
  * @brief TIM Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR1;                            /*!<TIM Control Register 1                         offset: 0x00       */
    __IO uint32_t CR2;                            /*!<TIM Control Register 2                         offset: 0x04       */
    __IO uint32_t SMCR;                           /*!<TIM Slave Mode Control Register                offset: 0x08       */
    __IO uint32_t DIER;                           /*!<TIM DMA/Interrupt Enable Register (DMA is      offset: 0x0C
                                                      only suitable for the chip with built in DMA)                     */
    __IO uint32_t SR;                             /*!<TIM Status Register                            offset: 0x10       */
    __IO uint32_t EGR;                            /*!<TIM Event Generation Register                  offset: 0x14       */
    __IO uint32_t CCMR1;                          /*!<TIM Capture/Compare Mode Register 1            offset: 0x18       */
    __IO uint32_t CCMR2;                          /*!<TIM Capture/Compare Mode Register 2            offset: 0x1C       */
    __IO uint32_t CCER;                           /*!<TIM Capture/Compare Enable Register            offset: 0x20       */
    __IO uint32_t CNT;                            /*!<TIM Counter                                    offset: 0x24       */
    __IO uint32_t PSC;                            /*!<TIM Prescaler                                  offset: 0x28       */
    __IO uint32_t ARR;                            /*!<TIM Auto Reload Register                       offset: 0x2C       */
    __IO uint32_t RCR;                            /*!<TIM Repeat Count Register                      offset: 0x30       */
    __IO uint32_t CCR1;                           /*!<TIM Capture/Compare Register 1                 offset: 0x34       */
    __IO uint32_t CCR2;                           /*!<TIM Capture/Compare Register 2                 offset: 0x38       */
    __IO uint32_t CCR3;                           /*!<TIM Capture/Compare Register 3                 offset: 0x3C       */
    __IO uint32_t CCR4;                           /*!<TIM Capture/Compare Register 4                 offset: 0x40       */
    __IO uint32_t BDTR;                           /*!<TIM Break And Dead-Time Register               offset: 0x44       */
    __IO uint32_t DCR;                            /*!<TIM DMA Control Register (only suitable for    offset: 0x48
                                                      the chip with built in DMA)                                       */
    __IO uint32_t DMAR;                           /*!<TIM DMA Address Register Of Continuous Mode    offset: 0x4C
                                                      (only suitable for the chip with built in     
                                                      DMA)                                                              */
    __IO uint32_t OR;                             /*!<TIM Input Option Register                      offset: 0x50       */
    __IO uint32_t CCMR3;                          /*!<TIM Input Option Register                      offset: 0x54       */
    __IO uint32_t CCR5;                           /*!<TIM Capture/Compare Register 5                 offset: 0x58       */
    __IO uint32_t PDER;                           /*!<TIM PWM Phase Shift/DMA Repeat Update Request  offset: 0x5C
                                                      Enable Register                                                   */
    __IO uint32_t CCR1FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x60
                                                      Capture/Compare Register                                          */
    __IO uint32_t CCR2FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x64
                                                      Capture/Compare Register                                          */
    __IO uint32_t CCR3FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x68
                                                      Capture/Compare Register                                          */
    __IO uint32_t CCR4FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x6C
                                                      Capture/Compare Register                                          */
    __IO uint32_t CCR5FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x70
                                                      Capture/Compare Register                                          */
    __IO uint32_t BKINF;                          /*!<TIM Break Input Filter Register                offset: 0x74       */
    __IO uint32_t CCR6;                           /*!<TIM Capture/Compare Register 6                 offset: 0x78       */
    __IO uint32_t CCR6FALL;                       /*!<TIM PWM Phase Shift Count Down                 offset: 0x7C
                                                      Capture/Compare Register 6                                        */
    __IO uint32_t DOCR;                           /*!<TIM Debug Output Control Register              offset: 0x80       */
} TIM_TypeDef;

/**
  * @brief TIM type pointer Definition
  */
#define TIM2                                      ((TIM_TypeDef *)TIM2_BASE)
#define TIM3                                      ((TIM_TypeDef *)TIM3_BASE)
#define TIM4                                      ((TIM_TypeDef *)TIM4_BASE)
#define TIM5                                      ((TIM_TypeDef *)TIM5_BASE)
#define TIM6                                      ((TIM_TypeDef *)TIM6_BASE)
#define TIM7                                      ((TIM_TypeDef *)TIM7_BASE)
#define TIM1                                      ((TIM_TypeDef *)TIM1_BASE)
#define TIM8                                      ((TIM_TypeDef *)TIM8_BASE)

/**
  * @brief TIM_CR1 Register Bit Definition
  */
#define  TIM_CR1_CEN_Pos                          (0)
#define  TIM_CR1_CEN_Msk                          (0x1U << TIM_CR1_CEN_Pos)                         /*!<Counter enable*/
#define  TIM_CR1_CEN                              TIM_CR1_CEN_Msk
#define  TIM_CR1_UDIS_Pos                         (1)
#define  TIM_CR1_UDIS_Msk                         (0x1U << TIM_CR1_UDIS_Pos)                        /*!<Update disable*/
#define  TIM_CR1_UDIS                             TIM_CR1_UDIS_Msk
#define  TIM_CR1_URS_Pos                          (2)
#define  TIM_CR1_URS_Msk                          (0x1U << TIM_CR1_URS_Pos)                         /*!<Update request source*/
#define  TIM_CR1_URS                              TIM_CR1_URS_Msk
#define  TIM_CR1_OPM_Pos                          (3)
#define  TIM_CR1_OPM_Msk                          (0x1U << TIM_CR1_OPM_Pos)                         /*!<one-pulse mode*/
#define  TIM_CR1_OPM                              TIM_CR1_OPM_Msk
#define  TIM_CR1_DIR_Pos                          (4)
#define  TIM_CR1_DIR_Msk                          (0x1U << TIM_CR1_DIR_Pos)                         /*!<Count direction*/
#define  TIM_CR1_DIR                              TIM_CR1_DIR_Msk
#define  TIM_CR1_CMS_Pos                          (5)
#define  TIM_CR1_CMS_Msk                          (0x3U << TIM_CR1_CMS_Pos)                         /*!<Center alignment mode selection*/
#define  TIM_CR1_CMS                              TIM_CR1_CMS_Msk
#define  TIM_CR1_CMS_Bit0                         (0x1U << TIM_CR1_CMS_Pos) 
#define  TIM_CR1_CMS_Bit1                         (0x2U << TIM_CR1_CMS_Pos) 
#define  TIM_CR1_ARPE_Pos                         (7)
#define  TIM_CR1_ARPE_Msk                         (0x1U << TIM_CR1_ARPE_Pos)                        /*!<Auto reload preload enable*/
#define  TIM_CR1_ARPE                             TIM_CR1_ARPE_Msk
#define  TIM_CR1_CKD_Pos                          (8)
#define  TIM_CR1_CKD_Msk                          (0x3U << TIM_CR1_CKD_Pos)                         /*!<Clock division*/
#define  TIM_CR1_CKD                              TIM_CR1_CKD_Msk
#define  TIM_CR1_CKD_Bit0                         (0x1U << TIM_CR1_CKD_Pos) 
#define  TIM_CR1_CKD_Bit1                         (0x2U << TIM_CR1_CKD_Pos) 

/**
  * @brief TIM_CR2 Register Bit Definition
  */
#define  TIM_CR2_CCPC_Pos                         (0)
#define  TIM_CR2_CCPC_Msk                         (0x1U << TIM_CR2_CCPC_Pos)                        /*!<Capture/compare preloaded control bit*/
#define  TIM_CR2_CCPC                             TIM_CR2_CCPC_Msk
#define  TIM_CR2_CCUS_Pos                         (2)
#define  TIM_CR2_CCUS_Msk                         (0x1U << TIM_CR2_CCUS_Pos)                        /*!<Capture/compare control update selection*/
#define  TIM_CR2_CCUS                             TIM_CR2_CCUS_Msk
#define  TIM_CR2_CCDS_Pos                         (3)
#define  TIM_CR2_CCDS_Msk                         (0x1U << TIM_CR2_CCDS_Pos)                        /*!<DMA request source selection*/
#define  TIM_CR2_CCDS                             TIM_CR2_CCDS_Msk
#define  TIM_CR2_MMS_Pos                          (4)
#define  TIM_CR2_MMS_Msk                          (0x7U << TIM_CR2_MMS_Pos)                         /*!<Master mode selection*/
#define  TIM_CR2_MMS                              TIM_CR2_MMS_Msk
#define  TIM_CR2_MMS_Bit0                         (0x1U << TIM_CR2_MMS_Pos) 
#define  TIM_CR2_MMS_Bit1                         (0x2U << TIM_CR2_MMS_Pos) 
#define  TIM_CR2_MMS_Bit2                         (0x4U << TIM_CR2_MMS_Pos) 
#define  TIM_CR2_TI1S_Pos                         (7)
#define  TIM_CR2_TI1S_Msk                         (0x1U << TIM_CR2_TI1S_Pos)                        /*!<TI1 selection*/
#define  TIM_CR2_TI1S                             TIM_CR2_TI1S_Msk
#define  TIM_CR2_OIS1_Pos                         (8)
#define  TIM_CR2_OIS1_Msk                         (0x1U << TIM_CR2_OIS1_Pos)                        /*!<(Output idle state 1) (OC1 output)*/
#define  TIM_CR2_OIS1                             TIM_CR2_OIS1_Msk
#define  TIM_CR2_OIS1N_Pos                        (9)
#define  TIM_CR2_OIS1N_Msk                        (0x1U << TIM_CR2_OIS1N_Pos)                       /*!<(Output idle state 1) (OC1N output)*/
#define  TIM_CR2_OIS1N                            TIM_CR2_OIS1N_Msk
#define  TIM_CR2_OIS2_Pos                         (10)
#define  TIM_CR2_OIS2_Msk                         (0x1U << TIM_CR2_OIS2_Pos)                        /*!<Output idle state 2 (OC2 output). Refer to OIS1 bit.*/
#define  TIM_CR2_OIS2                             TIM_CR2_OIS2_Msk
#define  TIM_CR2_OIS2N_Pos                        (11)
#define  TIM_CR2_OIS2N_Msk                        (0x1U << TIM_CR2_OIS2N_Pos)                       /*!<Output idle state 2 (OC2N output). Refer to OIS1N bit.*/
#define  TIM_CR2_OIS2N                            TIM_CR2_OIS2N_Msk
#define  TIM_CR2_OIS3_Pos                         (12)
#define  TIM_CR2_OIS3_Msk                         (0x1U << TIM_CR2_OIS3_Pos)                        /*!<Output idle state 3 (OC3 output). Refer to OIS1 bit.*/
#define  TIM_CR2_OIS3                             TIM_CR2_OIS3_Msk
#define  TIM_CR2_OIS3N_Pos                        (13)
#define  TIM_CR2_OIS3N_Msk                        (0x1U << TIM_CR2_OIS3N_Pos)                       /*!<Output idle state 3 (OC3N output). Refer to OIS1N bit.*/
#define  TIM_CR2_OIS3N                            TIM_CR2_OIS3N_Msk
#define  TIM_CR2_OIS4_Pos                         (14)
#define  TIM_CR2_OIS4_Msk                         (0x1U << TIM_CR2_OIS4_Pos)                        /*!<Output idle state 4 (OC4 output). Refer to OIS1 bit.*/
#define  TIM_CR2_OIS4                             TIM_CR2_OIS4_Msk
#define  TIM_CR2_OIS4N_Pos                        (15)
#define  TIM_CR2_OIS4N_Msk                        (0x1U << TIM_CR2_OIS4N_Pos)                       /*!<Output idle state 4 (OC4N output). Refer to OIS1N bit.*/
#define  TIM_CR2_OIS4N                            TIM_CR2_OIS4N_Msk

/**
  * @brief TIM_SMCR Register Bit Definition
  */
#define  TIM_SMCR_SMS_Pos                         (0)
#define  TIM_SMCR_SMS_Msk                         (0x7U << TIM_SMCR_SMS_Pos)                        /*!<Slave mode selection*/
#define  TIM_SMCR_SMS                             TIM_SMCR_SMS_Msk
#define  TIM_SMCR_SMS_Bit0                        (0x1U << TIM_SMCR_SMS_Pos) 
#define  TIM_SMCR_SMS_Bit1                        (0x2U << TIM_SMCR_SMS_Pos) 
#define  TIM_SMCR_SMS_Bit2                        (0x4U << TIM_SMCR_SMS_Pos) 
#define  TIM_SMCR_OCCS_Pos                        (3)
#define  TIM_SMCR_OCCS_Msk                        (0x1U << TIM_SMCR_OCCS_Pos)                       /*!<Timer compare output signal(OCxREF) clear selection*/
#define  TIM_SMCR_OCCS                            TIM_SMCR_OCCS_Msk
#define  TIM_SMCR_TSL_Pos                         (4)
#define  TIM_SMCR_TSL_Msk                         (0x7U << TIM_SMCR_TSL_Pos)                        /*!<Trigger selection*/
#define  TIM_SMCR_TSL                             TIM_SMCR_TSL_Msk
#define  TIM_SMCR_TSL_Bit0                        (0x1U << TIM_SMCR_TSL_Pos) 
#define  TIM_SMCR_TSL_Bit1                        (0x2U << TIM_SMCR_TSL_Pos) 
#define  TIM_SMCR_TSL_Bit2                        (0x4U << TIM_SMCR_TSL_Pos) 
#define  TIM_SMCR_MSM_Pos                         (7)
#define  TIM_SMCR_MSM_Msk                         (0x1U << TIM_SMCR_MSM_Pos)                        /*!<Master/slave mode*/
#define  TIM_SMCR_MSM                             TIM_SMCR_MSM_Msk
#define  TIM_SMCR_ETF_Pos                         (8)
#define  TIM_SMCR_ETF_Msk                         (0xFU << TIM_SMCR_ETF_Pos)                        /*!<External trigger filter*/
#define  TIM_SMCR_ETF                             TIM_SMCR_ETF_Msk
#define  TIM_SMCR_ETF_Bit0                        (0x1U << TIM_SMCR_ETF_Pos) 
#define  TIM_SMCR_ETF_Bit1                        (0x2U << TIM_SMCR_ETF_Pos) 
#define  TIM_SMCR_ETF_Bit2                        (0x4U << TIM_SMCR_ETF_Pos) 
#define  TIM_SMCR_ETF_Bit3                        (0x8U << TIM_SMCR_ETF_Pos) 
#define  TIM_SMCR_ETPS_Pos                        (12)
#define  TIM_SMCR_ETPS_Msk                        (0x3U << TIM_SMCR_ETPS_Pos)                       /*!<External trigger prescaler*/
#define  TIM_SMCR_ETPS                            TIM_SMCR_ETPS_Msk
#define  TIM_SMCR_ETPS_Bit0                       (0x1U << TIM_SMCR_ETPS_Pos) 
#define  TIM_SMCR_ETPS_Bit1                       (0x2U << TIM_SMCR_ETPS_Pos) 
#define  TIM_SMCR_ECE_Pos                         (14)
#define  TIM_SMCR_ECE_Msk                         (0x1U << TIM_SMCR_ECE_Pos)                        /*!<External clock enable*/
#define  TIM_SMCR_ECE                             TIM_SMCR_ECE_Msk
#define  TIM_SMCR_ETP_Pos                         (15)
#define  TIM_SMCR_ETP_Msk                         (0x1U << TIM_SMCR_ETP_Pos)                        /*!<External trigger polarity*/
#define  TIM_SMCR_ETP                             TIM_SMCR_ETP_Msk
#define  TIM_SMCR_TSH_Pos                         (20)
#define  TIM_SMCR_TSH_Msk                         (0x3U << TIM_SMCR_TSH_Pos)                        /*!<Trigger selection*/
#define  TIM_SMCR_TSH                             TIM_SMCR_TSH_Msk
#define  TIM_SMCR_TSH_Bit0                        (0x1U << TIM_SMCR_TSH_Pos) 
#define  TIM_SMCR_TSH_Bit1                        (0x2U << TIM_SMCR_TSH_Pos) 

