SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_tim.h
/**
  * @brief TIM_CCER Register Bit Definition
  */
#define  TIM_CCER_CC1E_Pos                        (0)
#define  TIM_CCER_CC1E_Msk                        (0x1U << TIM_CCER_CC1E_Pos)                       /*!<Channel 1 input/capture output enable*/
#define  TIM_CCER_CC1E                            TIM_CCER_CC1E_Msk
#define  TIM_CCER_CC1P_Pos                        (1)
#define  TIM_CCER_CC1P_Msk                        (0x1U << TIM_CCER_CC1P_Pos)                       /*!<Channel 1 input/capture output polarity*/
#define  TIM_CCER_CC1P                            TIM_CCER_CC1P_Msk
#define  TIM_CCER_CC1NE_Pos                       (2)
#define  TIM_CCER_CC1NE_Msk                       (0x1U << TIM_CCER_CC1NE_Pos)                      /*!<Channel 1 input/capture complementary output enable*/
#define  TIM_CCER_CC1NE                           TIM_CCER_CC1NE_Msk
#define  TIM_CCER_CC1NP_Pos                       (3)
#define  TIM_CCER_CC1NP_Msk                       (0x1U << TIM_CCER_CC1NP_Pos)                      /*!<Channel 1 input/capture complementary output polarity*/
#define  TIM_CCER_CC1NP                           TIM_CCER_CC1NP_Msk
#define  TIM_CCER_CC2E_Pos                        (4)
#define  TIM_CCER_CC2E_Msk                        (0x1U << TIM_CCER_CC2E_Pos)                       /*!<Channel 2 input/capture output enable*/
#define  TIM_CCER_CC2E                            TIM_CCER_CC2E_Msk
#define  TIM_CCER_CC2P_Pos                        (5)
#define  TIM_CCER_CC2P_Msk                        (0x1U << TIM_CCER_CC2P_Pos)                       /*!<Channel 2 input capture output polarity*/
#define  TIM_CCER_CC2P                            TIM_CCER_CC2P_Msk
#define  TIM_CCER_CC2NE_Pos                       (6)
#define  TIM_CCER_CC2NE_Msk                       (0x1U << TIM_CCER_CC2NE_Pos)                      /*!<Channel 2 input/capture complementary output enable*/
#define  TIM_CCER_CC2NE                           TIM_CCER_CC2NE_Msk
#define  TIM_CCER_CC2NP_Pos                       (7)
#define  TIM_CCER_CC2NP_Msk                       (0x1U << TIM_CCER_CC2NP_Pos)                      /*!<Channel 2 input/capture complementary output polarity*/
#define  TIM_CCER_CC2NP                           TIM_CCER_CC2NP_Msk
#define  TIM_CCER_CC3E_Pos                        (8)
#define  TIM_CCER_CC3E_Msk                        (0x1U << TIM_CCER_CC3E_Pos)                       /*!<Channel 3 input/capture output enable*/
#define  TIM_CCER_CC3E                            TIM_CCER_CC3E_Msk
#define  TIM_CCER_CC3P_Pos                        (9)
#define  TIM_CCER_CC3P_Msk                        (0x1U << TIM_CCER_CC3P_Pos)                       /*!<Channel 3 input capture output polarity*/
#define  TIM_CCER_CC3P                            TIM_CCER_CC3P_Msk
#define  TIM_CCER_CC3NE_Pos                       (10)
#define  TIM_CCER_CC3NE_Msk                       (0x1U << TIM_CCER_CC3NE_Pos)                      /*!<Channel 3 input/capture complementary output enable*/
#define  TIM_CCER_CC3NE                           TIM_CCER_CC3NE_Msk
#define  TIM_CCER_CC3NP_Pos                       (11)
#define  TIM_CCER_CC3NP_Msk                       (0x1U << TIM_CCER_CC3NP_Pos)                      /*!<Channel 3 input/capture complementary output polarity*/
#define  TIM_CCER_CC3NP                           TIM_CCER_CC3NP_Msk
#define  TIM_CCER_CC4E_Pos                        (12)
#define  TIM_CCER_CC4E_Msk                        (0x1U << TIM_CCER_CC4E_Pos)                       /*!<Channel 4 capture/compare enable*/
#define  TIM_CCER_CC4E                            TIM_CCER_CC4E_Msk
#define  TIM_CCER_CC4P_Pos                        (13)
#define  TIM_CCER_CC4P_Msk                        (0x1U << TIM_CCER_CC4P_Pos)                       /*!<Channel 4 capture/compare output polarity*/
#define  TIM_CCER_CC4P                            TIM_CCER_CC4P_Msk
#define  TIM_CCER_CC4NE_Pos                       (14)
#define  TIM_CCER_CC4NE_Msk                       (0x1U << TIM_CCER_CC4NE_Pos)                      /*!<Channel 4 input/capture complementary output enable*/
#define  TIM_CCER_CC4NE                           TIM_CCER_CC4NE_Msk
#define  TIM_CCER_CC4NP_Pos                       (15)
#define  TIM_CCER_CC4NP_Msk                       (0x1U << TIM_CCER_CC4NP_Pos)                      /*!<Channel 4 input/capture complementary output polarity*/
#define  TIM_CCER_CC4NP                           TIM_CCER_CC4NP_Msk

/**
  * @brief TIM_CNT Register Bit Definition
  */
#define  TIM_CNT_CNT_Pos                          (0)
#define  TIM_CNT_CNT_Msk                          (0xFFFFU << TIM_CNT_CNT_Pos)                      /*!<Counter value*/
#define  TIM_CNT_CNT                              TIM_CNT_CNT_Msk
#define  TIM_CNT_CNT_Bit0                         (0x0001U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit1                         (0x0002U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit2                         (0x0004U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit3                         (0x0008U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit4                         (0x0010U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit5                         (0x0020U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit6                         (0x0040U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit7                         (0x0080U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit8                         (0x0100U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit9                         (0x0200U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit10                        (0x0400U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit11                        (0x0800U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit12                        (0x1000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit13                        (0x2000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit14                        (0x4000U << TIM_CNT_CNT_Pos) 
#define  TIM_CNT_CNT_Bit15                        (0x8000U << TIM_CNT_CNT_Pos) 

/**
  * @brief TIM_PSC Register Bit Definition
  */
#define  TIM_PSC_PSC_Pos                          (0)
#define  TIM_PSC_PSC_Msk                          (0xFFFFU << TIM_PSC_PSC_Pos)                      /*!<Prescaler value*/
#define  TIM_PSC_PSC                              TIM_PSC_PSC_Msk
#define  TIM_PSC_PSC_Bit0                         (0x0001U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit1                         (0x0002U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit2                         (0x0004U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit3                         (0x0008U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit4                         (0x0010U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit5                         (0x0020U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit6                         (0x0040U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit7                         (0x0080U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit8                         (0x0100U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit9                         (0x0200U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit10                        (0x0400U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit11                        (0x0800U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit12                        (0x1000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit13                        (0x2000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit14                        (0x4000U << TIM_PSC_PSC_Pos) 
#define  TIM_PSC_PSC_Bit15                        (0x8000U << TIM_PSC_PSC_Pos) 

/**
  * @brief TIM_ARR Register Bit Definition
  */
#define  TIM_ARR_ARR_Pos                          (0)
#define  TIM_ARR_ARR_Msk                          (0xFFFFU << TIM_ARR_ARR_Pos)                      /*!<Auto reload value*/
#define  TIM_ARR_ARR                              TIM_ARR_ARR_Msk
#define  TIM_ARR_ARR_Bit0                         (0x0001U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit1                         (0x0002U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit2                         (0x0004U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit3                         (0x0008U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit4                         (0x0010U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit5                         (0x0020U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit6                         (0x0040U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit7                         (0x0080U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit8                         (0x0100U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit9                         (0x0200U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit10                        (0x0400U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit11                        (0x0800U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit12                        (0x1000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit13                        (0x2000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit14                        (0x4000U << TIM_ARR_ARR_Pos) 
#define  TIM_ARR_ARR_Bit15                        (0x8000U << TIM_ARR_ARR_Pos) 

/**
  * @brief TIM_RCR Register Bit Definition
  */
#define  TIM_RCR_REP_Pos                          (0)
#define  TIM_RCR_REP_Msk                          (0xFFU << TIM_RCR_REP_Pos)                        /*!<Repeat counter value*/
#define  TIM_RCR_REP                              TIM_RCR_REP_Msk
#define  TIM_RCR_REP_Bit0                         (0x01U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit1                         (0x02U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit2                         (0x04U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit3                         (0x08U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit4                         (0x10U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit5                         (0x20U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit6                         (0x40U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit7                         (0x80U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_CNT_Pos                      (8)
#define  TIM_RCR_REP_CNT_Msk                      (0xFFU << TIM_RCR_REP_CNT_Pos)                    /*!<Real-time value written by the repeat counter*/
#define  TIM_RCR_REP_CNT                          TIM_RCR_REP_CNT_Msk
#define  TIM_RCR_REP_CNT_Bit0                     (0x01U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit1                     (0x02U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit2                     (0x04U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit3                     (0x08U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit4                     (0x10U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit5                     (0x20U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit6                     (0x40U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit7                     (0x80U << TIM_RCR_REP_CNT_Pos) 

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFU << TIM_CCR1_CCR1_Pos)                    /*!<Channel 1 capture/compare value*/
#define  TIM_CCR1_CCR1                            TIM_CCR1_CCR1_Msk
#define  TIM_CCR1_CCR1_Bit0                       (0x0001U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit1                       (0x0002U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit2                       (0x0004U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit3                       (0x0008U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit4                       (0x0010U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit5                       (0x0020U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit6                       (0x0040U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit7                       (0x0080U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit8                       (0x0100U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit9                       (0x0200U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit10                      (0x0400U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit11                      (0x0800U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit12                      (0x1000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit13                      (0x2000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit14                      (0x4000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit15                      (0x8000U << TIM_CCR1_CCR1_Pos) 

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFU << TIM_CCR2_CCR2_Pos)                    /*!<Channel 2 capture/compare value*/
#define  TIM_CCR2_CCR2                            TIM_CCR2_CCR2_Msk
#define  TIM_CCR2_CCR2_Bit0                       (0x0001U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit1                       (0x0002U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit2                       (0x0004U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit3                       (0x0008U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit4                       (0x0010U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit5                       (0x0020U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit6                       (0x0040U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit7                       (0x0080U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit8                       (0x0100U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit9                       (0x0200U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit10                      (0x0400U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit11                      (0x0800U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit12                      (0x1000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit13                      (0x2000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit14                      (0x4000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit15                      (0x8000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR1_Pos                        (0)
#define  TIM_CCR2_CCR1_Msk                        (0xFFFFU << TIM_CCR2_CCR1_Pos)                    /*!<Channel 2 capture/compare value*/
#define  TIM_CCR2_CCR1                            TIM_CCR2_CCR1_Msk
#define  TIM_CCR2_CCR1_Bit0                       (0x0001U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit1                       (0x0002U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit2                       (0x0004U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit3                       (0x0008U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit4                       (0x0010U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit5                       (0x0020U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit6                       (0x0040U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit7                       (0x0080U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit8                       (0x0100U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit9                       (0x0200U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit10                      (0x0400U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit11                      (0x0800U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit12                      (0x1000U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit13                      (0x2000U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit14                      (0x4000U << TIM_CCR2_CCR1_Pos) 
#define  TIM_CCR2_CCR1_Bit15                      (0x8000U << TIM_CCR2_CCR1_Pos) 

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFU << TIM_CCR3_CCR3_Pos)                    /*!<Channel 3 capture/compare value*/
#define  TIM_CCR3_CCR3                            TIM_CCR3_CCR3_Msk
#define  TIM_CCR3_CCR3_Bit0                       (0x0001U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit1                       (0x0002U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit2                       (0x0004U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit3                       (0x0008U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit4                       (0x0010U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit5                       (0x0020U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit6                       (0x0040U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit7                       (0x0080U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit8                       (0x0100U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit9                       (0x0200U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit10                      (0x0400U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit11                      (0x0800U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit12                      (0x1000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit13                      (0x2000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit14                      (0x4000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit15                      (0x8000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR1_Pos                        (0)
#define  TIM_CCR3_CCR1_Msk                        (0xFFFFU << TIM_CCR3_CCR1_Pos)                    /*!<Channel 3 capture/compare value*/
#define  TIM_CCR3_CCR1                            TIM_CCR3_CCR1_Msk
#define  TIM_CCR3_CCR1_Bit0                       (0x0001U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit1                       (0x0002U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit2                       (0x0004U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit3                       (0x0008U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit4                       (0x0010U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit5                       (0x0020U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit6                       (0x0040U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit7                       (0x0080U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit8                       (0x0100U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit9                       (0x0200U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit10                      (0x0400U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit11                      (0x0800U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit12                      (0x1000U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit13                      (0x2000U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit14                      (0x4000U << TIM_CCR3_CCR1_Pos) 
#define  TIM_CCR3_CCR1_Bit15                      (0x8000U << TIM_CCR3_CCR1_Pos) 

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR1_Pos                        (0)
#define  TIM_CCR4_CCR1_Msk                        (0xFFFFU << TIM_CCR4_CCR1_Pos)                    /*!<Channel 4 capture/compare value*/
#define  TIM_CCR4_CCR1                            TIM_CCR4_CCR1_Msk
#define  TIM_CCR4_CCR1_Bit0                       (0x0001U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit1                       (0x0002U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit2                       (0x0004U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit3                       (0x0008U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit4                       (0x0010U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit5                       (0x0020U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit6                       (0x0040U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit7                       (0x0080U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit8                       (0x0100U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit9                       (0x0200U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit10                      (0x0400U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit11                      (0x0800U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit12                      (0x1000U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit13                      (0x2000U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit14                      (0x4000U << TIM_CCR4_CCR1_Pos) 
#define  TIM_CCR4_CCR1_Bit15                      (0x8000U << TIM_CCR4_CCR1_Pos) 

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)                       /*!<Dead-time generator setup adjustment*/
#define  TIM_BDTR_DTG                             TIM_BDTR_DTG_Msk
#define  TIM_BDTR_DTG_Bit0                        (0x01U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit1                        (0x02U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit2                        (0x04U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit3                        (0x08U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit4                        (0x10U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit5                        (0x20U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit6                        (0x40U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit7                        (0x80U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x3U << TIM_BDTR_LOCK_Pos)                       /*!<Lock configuration*/
#define  TIM_BDTR_LOCK                            TIM_BDTR_LOCK_Msk
#define  TIM_BDTR_LOCK_Bit0                       (0x1U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_LOCK_Bit1                       (0x2U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x1U << TIM_BDTR_OSSI_Pos)                       /*!<Off state selection in the idle mode*/
#define  TIM_BDTR_OSSI                            TIM_BDTR_OSSI_Msk
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x1U << TIM_BDTR_OSSR_Pos)                       /*!<Off state selection in the run mode*/
#define  TIM_BDTR_OSSR                            TIM_BDTR_OSSR_Msk
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x1U << TIM_BDTR_BKE_Pos)                        /*!<Break function enable*/
#define  TIM_BDTR_BKE                             TIM_BDTR_BKE_Msk
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x1U << TIM_BDTR_BKP_Pos)                        /*!<Break input polarity*/
#define  TIM_BDTR_BKP                             TIM_BDTR_BKP_Msk
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x1U << TIM_BDTR_AOE_Pos)                        /*!<Auto output enable*/
#define  TIM_BDTR_AOE                             TIM_BDTR_AOE_Msk
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x1U << TIM_BDTR_MOE_Pos)                        /*!<Main output enable*/
#define  TIM_BDTR_MOE                             TIM_BDTR_MOE_Msk
#define  TIM_BDTR_DOE_Pos                         (16)
#define  TIM_BDTR_DOE_Msk                         (0x1U << TIM_BDTR_DOE_Pos)                        /*!<Direct output enable*/
#define  TIM_BDTR_DOE                             TIM_BDTR_DOE_Msk

