SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_tim.h
/**
  * @brief TIM_DCR Register Bit Definition
  */
#define  TIM_DCR_DBA_Pos                          (0)
#define  TIM_DCR_DBA_Msk                          (0x1FU << TIM_DCR_DBA_Pos)                        /*!<DMA base address*/
#define  TIM_DCR_DBA                              TIM_DCR_DBA_Msk
#define  TIM_DCR_DBA_Bit0                         (0x01U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit1                         (0x02U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit2                         (0x04U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit3                         (0x08U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBA_Bit4                         (0x10U << TIM_DCR_DBA_Pos) 
#define  TIM_DCR_DBL_Pos                          (8)
#define  TIM_DCR_DBL_Msk                          (0x1FU << TIM_DCR_DBL_Pos)                        /*!<DMA continuous transmission length*/
#define  TIM_DCR_DBL                              TIM_DCR_DBL_Msk
#define  TIM_DCR_DBL_Bit0                         (0x01U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit1                         (0x02U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit2                         (0x04U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit3                         (0x08U << TIM_DCR_DBL_Pos) 
#define  TIM_DCR_DBL_Bit4                         (0x10U << TIM_DCR_DBL_Pos) 

/**
  * @brief TIM_DMAR Register Bit Definition
  */
#define  TIM_DMAR_DMAB_Pos                        (0)
#define  TIM_DMAR_DMAB_Msk                        (0xFFFFU << TIM_DMAR_DMAB_Pos)                    /*!<DMA register for burst accesses*/
#define  TIM_DMAR_DMAB                            TIM_DMAR_DMAB_Msk
#define  TIM_DMAR_DMAB_Bit0                       (0x0001U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit1                       (0x0002U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit2                       (0x0004U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit3                       (0x0008U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit4                       (0x0010U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit5                       (0x0020U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit6                       (0x0040U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit7                       (0x0080U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit8                       (0x0100U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit9                       (0x0200U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit10                      (0x0400U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit11                      (0x0800U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit12                      (0x1000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit13                      (0x2000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit14                      (0x4000U << TIM_DMAR_DMAB_Pos) 
#define  TIM_DMAR_DMAB_Bit15                      (0x8000U << TIM_DMAR_DMAB_Pos) 

/**
  * @brief TIM_OR Register Bit Definition
  */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x7U << TIM_OR_ETR_RMP_Pos)                      /*!<Timer 5 ETR multiplex*/
#define  TIM_OR_ETR_RMP                           TIM_OR_ETR_RMP_Msk
#define  TIM_OR_ETR_RMP_Bit0                      (0x1U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_ETR_RMP_Bit1                      (0x2U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_ETR_RMP_Bit2                      (0x4U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Pos                       (6)
#define  TIM_OR_TI4_RMP_Msk                       (0x7U << TIM_OR_TI4_RMP_Pos)                      /*!<Timer 5 TI4 multiplex*/
#define  TIM_OR_TI4_RMP                           TIM_OR_TI4_RMP_Msk
#define  TIM_OR_TI4_RMP_Bit0                      (0x1U << TIM_OR_TI4_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Bit1                      (0x2U << TIM_OR_TI4_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Bit2                      (0x4U << TIM_OR_TI4_RMP_Pos) 

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define  TIM_CCMR3_OC5PE_Pos                      (3)
#define  TIM_CCMR3_OC5PE_Msk                      (0x1U << TIM_CCMR3_OC5PE_Pos)                     /*!<Output compare 5 preload enable*/
#define  TIM_CCMR3_OC5PE                          TIM_CCMR3_OC5PE_Msk
#define  TIM_CCMR3_OC6PE_Pos                      (11)
#define  TIM_CCMR3_OC6PE_Msk                      (0x1U << TIM_CCMR3_OC6PE_Pos)                     /*!<Output compare 6 preload enable*/
#define  TIM_CCMR3_OC6PE                          TIM_CCMR3_OC6PE_Msk

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define  TIM_CCR5_CCR5_Pos                        (0)
#define  TIM_CCR5_CCR5_Msk                        (0xFFFFU << TIM_CCR5_CCR5_Pos)                    /*!<Compare 5 value*/
#define  TIM_CCR5_CCR5                            TIM_CCR5_CCR5_Msk
#define  TIM_CCR5_CCR5_Bit0                       (0x0001U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit1                       (0x0002U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit2                       (0x0004U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit3                       (0x0008U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit4                       (0x0010U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit5                       (0x0020U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit6                       (0x0040U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit7                       (0x0080U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit8                       (0x0100U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit9                       (0x0200U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit10                      (0x0400U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit11                      (0x0800U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit12                      (0x1000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit13                      (0x2000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit14                      (0x4000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit15                      (0x8000U << TIM_CCR5_CCR5_Pos) 

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define  TIM_PDER_CCDREPE_Pos                     (0)
#define  TIM_PDER_CCDREPE_Msk                     (0x1U << TIM_PDER_CCDREPE_Pos)                    /*!<Enable DMA will generate the update request at each underflow or overflow*/
#define  TIM_PDER_CCDREPE                         TIM_PDER_CCDREPE_Msk
#define  TIM_PDER_CCR1_SHIFT_EN_Pos               (1)
#define  TIM_PDER_CCR1_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR1_SHIFT_EN_Pos)              /*!<Enable channel 1 output PWM phase shift bit*/
#define  TIM_PDER_CCR1_SHIFT_EN                   TIM_PDER_CCR1_SHIFT_EN_Msk
#define  TIM_PDER_CCR2_SHIFT_EN_Pos               (2)
#define  TIM_PDER_CCR2_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR2_SHIFT_EN_Pos)              /*!<Enable channel 2 output PWM phase shift bit*/
#define  TIM_PDER_CCR2_SHIFT_EN                   TIM_PDER_CCR2_SHIFT_EN_Msk
#define  TIM_PDER_CCR3_SHIFT_EN_Pos               (3)
#define  TIM_PDER_CCR3_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR3_SHIFT_EN_Pos)              /*!<Enable channel 3 output PWM phase shift bit*/
#define  TIM_PDER_CCR3_SHIFT_EN                   TIM_PDER_CCR3_SHIFT_EN_Msk
#define  TIM_PDER_CCR4_SHIFT_EN_Pos               (4)
#define  TIM_PDER_CCR4_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR4_SHIFT_EN_Pos)              /*!<Enable channel 4 output PWM phase shift bit*/
#define  TIM_PDER_CCR4_SHIFT_EN                   TIM_PDER_CCR4_SHIFT_EN_Msk
#define  TIM_PDER_CCR5_SHIFT_EN_Pos               (5)
#define  TIM_PDER_CCR5_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR5_SHIFT_EN_Pos)              /*!<Enable channel 5 output PWM phase shift bit*/
#define  TIM_PDER_CCR5_SHIFT_EN                   TIM_PDER_CCR5_SHIFT_EN_Msk
#define  TIM_PDER_CCR6_SHIFT_EN_Pos               (6)
#define  TIM_PDER_CCR6_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR6_SHIFT_EN_Pos)              /*!<Enable channel 6 output PWM phase shift bit*/
#define  TIM_PDER_CCR6_SHIFT_EN                   TIM_PDER_CCR6_SHIFT_EN_Msk

/**
  * @brief TIM_CCRFALL Register Bit Definition
  */
#define  TIM_CCR1FALL_CCR1FALL_Pos                (0)
#define  TIM_CCR1FALL_CCR1FALL_Msk                (0xFFFFU << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL                    TIM_CCR1FALL_CCR1FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR1FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR1FALL_CCR1FALL_Bit0               (0x0001U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit1               (0x0002U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit2               (0x0004U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit3               (0x0008U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit4               (0x0010U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit5               (0x0020U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit6               (0x0040U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit7               (0x0080U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit8               (0x0100U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit9               (0x0200U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit10              (0x0400U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit11              (0x0800U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit12              (0x1000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit13              (0x2000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit14              (0x4000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit15              (0x8000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Pos                (0)
#define  TIM_CCR2FALL_CCR2FALL_Msk                (0xFFFFU << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL                    TIM_CCR2FALL_CCR2FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR2FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR2FALL_CCR2FALL_Bit0               (0x0001U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit1               (0x0002U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit2               (0x0004U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit3               (0x0008U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit4               (0x0010U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit5               (0x0020U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit6               (0x0040U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit7               (0x0080U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit8               (0x0100U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit9               (0x0200U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit10              (0x0400U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit11              (0x0800U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit12              (0x1000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit13              (0x2000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit14              (0x4000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit15              (0x8000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Pos                (0)
#define  TIM_CCR3FALL_CCR3FALL_Msk                (0xFFFFU << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL                    TIM_CCR3FALL_CCR3FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR3FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR3FALL_CCR3FALL_Bit0               (0x0001U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit1               (0x0002U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit2               (0x0004U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit3               (0x0008U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit4               (0x0010U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit5               (0x0020U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit6               (0x0040U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit7               (0x0080U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit8               (0x0100U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit9               (0x0200U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit10              (0x0400U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit11              (0x0800U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit12              (0x1000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit13              (0x2000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit14              (0x4000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit15              (0x8000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Pos                (0)
#define  TIM_CCR4FALL_CCR4FALL_Msk                (0xFFFFU << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL                    TIM_CCR4FALL_CCR4FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR4FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR4FALL_CCR4FALL_Bit0               (0x0001U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit1               (0x0002U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit2               (0x0004U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit3               (0x0008U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit4               (0x0010U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit5               (0x0020U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit6               (0x0040U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit7               (0x0080U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit8               (0x0100U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit9               (0x0200U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit10              (0x0400U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit11              (0x0800U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit12              (0x1000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit13              (0x2000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit14              (0x4000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit15              (0x8000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Pos                (0)
#define  TIM_CCR5FALL_CCR5FALL_Msk                (0xFFFFU << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL                    TIM_CCR5FALL_CCR5FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR5FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR5FALL_CCR5FALL_Bit0               (0x0001U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit1               (0x0002U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit2               (0x0004U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit3               (0x0008U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit4               (0x0010U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit5               (0x0020U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit6               (0x0040U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit7               (0x0080U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit8               (0x0100U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit9               (0x0200U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit10              (0x0400U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit11              (0x0800U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit12              (0x1000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit13              (0x2000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit14              (0x4000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit15              (0x8000U << TIM_CCR5FALL_CCR5FALL_Pos) 

/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x1U << TIM_BKINF_BKINFE_Pos)                    /*!<Break input filter enable*/
#define  TIM_BKINF_BKINFE                         TIM_BKINF_BKINFE_Msk
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0xFU << TIM_BKINF_BKINF_Pos)                     /*!<Break input filter*/
#define  TIM_BKINF_BKINF                          TIM_BKINF_BKINF_Msk
#define  TIM_BKINF_BKINF_Bit0                     (0x1U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit1                     (0x2U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit2                     (0x4U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit3                     (0x8U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_CSSBKIN_SEL_Pos                (5)
#define  TIM_BKINF_CSSBKIN_SEL_Msk                (0x1U << TIM_BKINF_CSSBKIN_SEL_Pos)               /*!<CSS break input channel selects*/
#define  TIM_BKINF_CSSBKIN_SEL                    TIM_BKINF_CSSBKIN_SEL_Msk
#define  TIM_BKINF_IOBKIN_SELL_Pos                (6)
#define  TIM_BKINF_IOBKIN_SELL_Msk                (0x7FU << TIM_BKINF_IOBKIN_SELL_Pos)              /*!<IO break input channel selects*/
#define  TIM_BKINF_IOBKIN_SELL                    TIM_BKINF_IOBKIN_SELL_Msk
#define  TIM_BKINF_IOBKIN_SELL_Bit0               (0x01U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit1               (0x02U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit2               (0x04U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit3               (0x08U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit4               (0x10U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit5               (0x20U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_IOBKIN_SELL_Bit6               (0x40U << TIM_BKINF_IOBKIN_SELL_Pos) 
#define  TIM_BKINF_COMPBKIN_SEL_Pos               (13)
#define  TIM_BKINF_COMPBKIN_SEL_Msk               (0x7U << TIM_BKINF_COMPBKIN_SEL_Pos)              /*!<COMP break input channel selects*/
#define  TIM_BKINF_COMPBKIN_SEL                   TIM_BKINF_COMPBKIN_SEL_Msk
#define  TIM_BKINF_COMPBKIN_SEL_Bit0              (0x1U << TIM_BKINF_COMPBKIN_SEL_Pos) 
#define  TIM_BKINF_COMPBKIN_SEL_Bit1              (0x2U << TIM_BKINF_COMPBKIN_SEL_Pos) 
#define  TIM_BKINF_COMPBKIN_SEL_Bit2              (0x4U << TIM_BKINF_COMPBKIN_SEL_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Pos                (24)
#define  TIM_BKINF_IOBKIN_SELH_Msk                (0x7FU << TIM_BKINF_IOBKIN_SELH_Pos)              /*!<IO break input channel selects*/
#define  TIM_BKINF_IOBKIN_SELH                    TIM_BKINF_IOBKIN_SELH_Msk
#define  TIM_BKINF_IOBKIN_SELH_Bit0               (0x01U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit1               (0x02U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit2               (0x04U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit3               (0x08U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit4               (0x10U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit5               (0x20U << TIM_BKINF_IOBKIN_SELH_Pos) 
#define  TIM_BKINF_IOBKIN_SELH_Bit6               (0x40U << TIM_BKINF_IOBKIN_SELH_Pos) 

/**
  * @brief TIM_CCR6 Register Bit Definition
  */
#define  TIM_CCR6_CCR6_Pos                        (0)
#define  TIM_CCR6_CCR6_Msk                        (0xFFFFU << TIM_CCR6_CCR6_Pos)                    /*!<Channel 6 capture/compare value*/
#define  TIM_CCR6_CCR6                            TIM_CCR6_CCR6_Msk
#define  TIM_CCR6_CCR6_Bit0                       (0x0001U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit1                       (0x0002U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit2                       (0x0004U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit3                       (0x0008U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit4                       (0x0010U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit5                       (0x0020U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit6                       (0x0040U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit7                       (0x0080U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit8                       (0x0100U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit9                       (0x0200U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit10                      (0x0400U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit11                      (0x0800U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit12                      (0x1000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit13                      (0x2000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit14                      (0x4000U << TIM_CCR6_CCR6_Pos) 
#define  TIM_CCR6_CCR6_Bit15                      (0x8000U << TIM_CCR6_CCR6_Pos) 

