SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_tim.h
/**
  * @brief TIM_CCR6FALL Register Bit Definition
  */
#define  TIM_CCR6FALL_CCR6FALL_Pos                (0)
#define  TIM_CCR6FALL_CCR6FALL_Msk                (0xFFFFU << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL                    TIM_CCR6FALL_CCR6FALL_Msk                         /*!<Channel x capture/compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR6FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR6FALL_CCR6FALL_Bit0               (0x0001U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit1               (0x0002U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit2               (0x0004U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit3               (0x0008U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit4               (0x0010U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit5               (0x0020U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit6               (0x0040U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit7               (0x0080U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit8               (0x0100U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit9               (0x0200U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit10              (0x0400U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit11              (0x0800U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit12              (0x1000U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit13              (0x2000U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit14              (0x4000U << TIM_CCR6FALL_CCR6FALL_Pos) 
#define  TIM_CCR6FALL_CCR6FALL_Bit15              (0x8000U << TIM_CCR6FALL_CCR6FALL_Pos) 

/**
  * @brief TIM_DOCR Register Bit Definition
  */
#define  TIM_DOCR_DOS_Pos                         (0)
#define  TIM_DOCR_DOS_Msk                         (0x3U << TIM_DOCR_DOS_Pos)                        /*!<Debug halt Output select*/
#define  TIM_DOCR_DOS                             TIM_DOCR_DOS_Msk
#define  TIM_DOCR_DOS_Bit0                        (0x1U << TIM_DOCR_DOS_Pos) 
#define  TIM_DOCR_DOS_Bit1                        (0x2U << TIM_DOCR_DOS_Pos) 


#endif

